In [3]:
import pandas as pd
data={
    'Name':["Harsh","Dev","Kapil","Kunal","Ayush","Mohit"],
    'Marks':[31,23,75,67,70,81],
    'Age':[17,18,18,20,19,21]
}
df=pd.DataFrame(data)
print(df)

    Name  Marks  Age
0  Harsh     31   17
1    Dev     23   18
2  Kapil     75   18
3  Kunal     67   20
4  Ayush     70   19
5  Mohit     81   21

In [4]:
df=pd.Series(data)
print(df)

Name     [Harsh, Dev, Kapil, Kunal, Ayush, Mohit]
Marks                    [31, 23, 75, 67, 70, 81]
Age                      [17, 18, 18, 20, 19, 21]
dtype: object

In [20]:
df.head()        #Shows first 5 rows.
df.tail()	     #Shows last 5 rows.
df.describe()

count                                 7
unique                                7
top       [Ashish, bob, ee, de, er, dy]
freq                                  1
dtype: object

In [21]:
df.tail()	#Shows last 5 rows.

a    [1, 2, 3, 45, 5, 6]
b     [2, 9, 3, 4, 5, 6]
c     [4, 5, 4, 5, 6, 7]
d     [5, 6, 7, 8, 9, 4]
e     [2, 3, 4, 5, 6, 6]
dtype: object

In [22]:
df.describe()

count                                 7
unique                                7
top       [Ashish, bob, ee, de, er, dy]
freq                                  1
dtype: object

In [23]:
df.dtypes

dtype('O')

In [24]:
df(Marks).sum()

NameError: name 'Marks' is not defined

In [27]:
df.sort_values(by='Marks')

TypeError: Series.sort_values() got an unexpected keyword argument 'on'

In [28]:
df.groupby('Marks')

KeyError: 'Marks'

In [7]:
import pandas as pd
#import numpy as np

# First DataFrame
data1 = {
    'product': ['apple', 'banana', 'orange', 'grape'],
    'price': [50, 30, 40, 60],
    'quantity': [100, 150, 80, 60]
}
df1 = pd.DataFrame(data1)
print("First Data:\n",df1)

# Second DataFrame
data2 = {
    'product': ['apple', 'banana', 'kiwi', 'grape'],
    'price': [55, 35, 45, 60],
    'quantity': [90, 130, 50, 65]
}
df2 = pd.DataFrame(data2)
print("Second Data:\n",df2)

First Data:
   product  price  quantity
0   apple     50       100
1  banana     30       150
2  orange     40        80
3   grape     60        60
Second Data:
   product  price  quantity
0   apple     55        90
1  banana     35       130
2    kiwi     45        50
3   grape     60        65

In [10]:
# Add quantities (combine inventories):
df_combined = df1.add(df2, fill_value=0)
print(df_combined)

        product  price  quantity
0    appleapple    105       190
1  bananabanana     65       280
2    orangekiwi     85       130
3    grapegrape    120       125

In [12]:
df_merge=pd.merge(df1, df2, on='product') 
print(df_merge)

  product  price_x  quantity_x  price_y  quantity_y
0   apple       50         100       55          90
1  banana       30         150       35         130
2   grape       60          60       60          65

In [13]:
df1.compare(df2)

  product       price       quantity
     self other  self other     self other
0     NaN   NaN  50.0  55.0      100    90
1     NaN   NaN  30.0  35.0      150   130
2  orange  kiwi  40.0  45.0       80    50
3     NaN   NaN   NaN   NaN       60    65

In [14]:
df1.equals(df2)

False

In [15]:
pd.concat([df1, df2])

  product  price  quantity
0   apple     50       100
1  banana     30       150
2  orange     40        80
3   grape     60        60
0   apple     55        90
1  banana     35       130
2    kiwi     45        50
3   grape     60        65

In [16]:
df1.set_index('product').combine_first(df2.set_index('product'))

         price  quantity
product
apple       50       100
banana      30       150
grape       60        60
kiwi        45        50
orange      40        80

# Same Data Except 1 --  concat,add,subtract

In [42]:
import pandas as pd
invt1={
    'pen':[2],
    'apple':[1],
    'pencil':[2],
    'notebook':[4]
}
invt2={
    'pen':[4],
    'orange':[2],
    'apple':[3],
    'notebook':[5]
}

df3=pd.DataFrame(invt1)
df4=pd.DataFrame(invt2)
print("invt 1\n:",df3)
print("invt 2\n:",df4)

invt 1
:    pen  apple  pencil  notebook
0    2      1       2         4
invt 2
:    pen  orange  apple  notebook
0    4       2      3         5

In [43]:
# Concatenate DataFrames
pd.concat([df3, df4])

   pen  apple  pencil  notebook  orange
0    2      1     2.0         4     NaN
0    4      3     NaN         5     2.0

In [68]:
pd.merge(df3, df4, on="pen")

Empty DataFrame
Columns: [pen, apple_x, pencil_x, notebook_x, pencil_y, apple_y, notebook_y]
Index: []

In [44]:
# Add values (like +).
df3.add(df4, fill_value=0)

   apple  notebook  orange  pen  pencil
0      4         9     2.0    6     2.0

In [45]:
# 	Subtract values
df4.sub(df3, fill_value=0)

   apple  notebook  orange  pen  pencil
0      2         1     2.0    2    -2.0

In [70]:
df3.mul(df4)

   apple  notebook  pen  pencil
0      3        20    8       4

In [46]:
# Check if they're the same
df3.equals(df4)

False

# Same data - Product   --  == , != ,  > < <= >= , .compare	, .equals

In [51]:
import pandas as pd
invt1={
    'pen':[2],
    'apple':[1],
    'pencil':[2],
    'notebook':[4]
}
invt2={
    'pen':[4],
    'apple':[3],
    'pencil':[2],
    'notebook':[5]
}

df5=pd.DataFrame(invt1)
df6=pd.DataFrame(invt2)
print("invt 1\n:",df5)
print("invt 2\n:",df6)

invt 1
:    pen  apple  pencil  notebook
0    2      1       2         4
invt 2
:    pen  apple  pencil  notebook
0    4      3       2         5

In [53]:
# 	Check where values are equal
df5 == df6

     pen  apple  pencil  notebook
0  False  False    True     False

In [55]:
# Check where values differ.
df5!= df6

    pen  apple  pencil  notebook
0  True   True   False      True

In [62]:
# Element-wise comparison.
#df5 > df6
df5 >=df6
#df5 < df6
#df5 <= df6

     pen  apple  pencil  notebook
0  False  False    True     False

In [63]:
# Shows differences between two DataFrames.
df5.compare(df6)

   pen       apple       notebook
  self other  self other     self other
0    2     4     1     3        4     5

In [65]:
# Returns True if DataFrames are exactly the same.
df5.equals(df6)

False

----------------------------------------------------------------------------------------------------------------------------------------------------

In [24]:
df3.join(df4)

ValueError: columns overlap but no suffix specified: Index(['pen', 'apple', 'notebook'], dtype='object')